tutorials/compressible/nexaFoam/neTCLib/heatBath/heatBath_case3/0/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      initialConditions;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

TTRValue  5000;
TVibValue 30000;

pressureValue  101325;

velocityValue  (0 0 0);

N2_mass_fraction 0.5;
O2_mass_fraction 0.5;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
